Receive By ID Test Case/loadTestReceiveByID test with beanshell.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Receive By ID test plan">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="false">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonSlurper

// Read metadata.json file
def metadataJson = new File(&quot;/Users/moonlight/Desktop/loadtest-with-jmeter/Receive By ID Test Case/data/metadata.json&quot;).text
def metadata = (new JsonSlurper()).parseText(metadataJson)

def eventReceiveData = metadata.case_6[0].delivery.event[0].receive

log.info(&quot;===metadata&quot; + eventReceiveData.getClass())

props.put(&quot;eventReceiveData&quot;, eventReceiveData);

</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler" enabled="false">
          <stringProp name="scriptLanguage">javascript</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonSlurper

// Read metadata.json file
def metadataJson = new File(&quot;/Users/moonlight/Desktop/loadtest-with-jmeter/Receive By ID Test Case/data/metadata.json&quot;).text
def metadata = (new JsonSlurper()).parseText(metadataJson)

def eventReceiveData = metadata.case_6[0].delivery.event[0].receive

log.info(&quot;===metadata&quot; + eventReceiveData.getClass())

props.put(&quot;eventReceiveData&quot;, eventReceiveData);

</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.protocol">file</stringProp>
          <stringProp name="HTTPSampler.path">/Users/moonlight/Desktop/loadtest-with-jmeter/Receive By ID Test Case/data/metadata.json</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor in js" enabled="false">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">var response = prev.getResponseDataAsString();
var jsonData = JSON.parse(response);

var eventReceiveData = jsonData.case_6[0].delivery.event[0].receive

props.put(&quot;eventReceiveData&quot;,eventReceiveData)

log.info(&apos;==hi===&apos; + eventReceiveData.length)</stringProp>
            <stringProp name="scriptLanguage">javascript</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def response = prev.getResponseDataAsString();
def jsonData = new groovy.json.JsonSlurper().parseText(response);

def eventReceiveData = jsonData.case_6[0].delivery.event[0].receive

props.put(&quot;eventReceiveData&quot;, eventReceiveData)

log.info(&apos;==eventReceiveData===&apos; + eventReceiveData.size())</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="false">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">String propValue = props.get(&quot;eventReceiveData&quot;);
vars.put(&quot;eventReceiveData&quot;, propValue);

log.info(&quot;====propValue&quot; + propValue)</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="false">
          <stringProp name="scriptLanguage">javascript</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">var gg = props.get(&quot;eventReceiveData&quot;)
vars.put(&quot;eventReceiveData&quot;, propValue);

log.info(&apos;===gg&apos;, gg)

</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler in JS" enabled="false">
          <stringProp name="scriptLanguage">javascript</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">var eventReceiveData = props.get(&quot;eventReceiveData&quot;)

for (var i = 0; i &lt; 30; i++) {
    var receiveItem = eventReceiveData[i];
    
    // Extract values from the current &quot;receive&quot; item
    var receiveId = receiveItem.receive_id;
    var userId = receiveItem.user_id;
    
    // Set the user id as a variable for the HTTP sampler
    vars.put(&quot;userId&quot;, userId);
    
    // Create an HTTP Sampler for each user
    var sampler = new org.apache.jmeter.protocol.http.sampler.HTTPSamplerProxy();
    sampler.setDomain(&quot;localhost&quot;);
    sampler.setPort(33380);
    sampler.setPath(&quot;/api/v32/receives/ids/&quot;+ receiveId);
    sampler.setMethod(&quot;GET&quot;);
    sampler.setName(&quot;HTTP Request - &quot; + userId); // Set a unique name for each sampler
    
    // Add any additional configurations to the sampler if needed
    
    // Run the HTTP Sampler
    sampler.sample(null);
}

</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">def receiveArray = props.get(&quot;eventReceiveData&quot;)

for (int i = 0; i &lt; 10; i++) {
    def receiveItem = receiveArray[i];



    // Extract values from the current &quot;receive&quot; item
    def receiveId = receiveItem.receive_id;


    def userId = receiveItem.user_id;

                	
    // Set the user id as a variable for the HTTP sampler
//    vars.put(&quot;userId&quot;, userId);

    
    // Create an HTTP Sampler for each user
    def sampler = new org.apache.jmeter.protocol.http.sampler.HTTPSamplerProxy();


    
    sampler.setDomain(&quot;localhost&quot;);

    sampler.setPort(33380);

    log.info(&apos;===i====&apos; + userId)
    sampler.setPath(&quot;/your-endpoint&quot;);
    sampler.setMethod(&quot;GET&quot;);
    sampler.setName(&quot;HTTP Request - &quot; + userId); // Set a unique name for each sampler
    
    // Run the HTTP Sampler
    sampler.sample(null);
}</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler" enabled="false">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">log.info(&apos;=====jjjj=====&apos; + vars.get(&quot;&quot;)</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler" enabled="false">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">log.info(&quot;====Value of myVariable: &quot; + props.get(&quot;eventReceiveData&quot;));</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only Controller" enabled="false"/>
        <hashTree>
          <ForeachController guiclass="ForeachControlPanel" testclass="ForeachController" testname="ForEach Controller">
            <stringProp name="ForeachController.inputVal">eventReceiveData</stringProp>
            <stringProp name="ForeachController.returnVal">ggwp</stringProp>
            <boolProp name="ForeachController.useSeparator">false</boolProp>
            <stringProp name="ForeachController.endIndex">5</stringProp>
            <stringProp name="ForeachController.startIndex">0</stringProp>
          </ForeachController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
              <stringProp name="HTTPSampler.domain">localhost</stringProp>
              <stringProp name="HTTPSampler.port">33380</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
            </HTTPSamplerProxy>
            <hashTree/>
          </hashTree>
        </hashTree>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="false"/>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="false">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="JSR223 Sampler" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonSlurper

// Read metadata.json file
def metadataJson = new File(&quot;/Users/moonlight/Desktop/loadtest-with-jmeter/Receive By ID Test Case/data/metadata.json&quot;).text
def metadata = (new JsonSlurper()).parseText(metadataJson)

def eventReceiveData = metadata.case_6[0].delivery.event[0].receive

log.info(&quot;===metadata&quot; + eventReceiveData.getClass())

props.put(&quot;eventReceiveData&quot;, eventReceiveData);</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="false">
          <stringProp name="BeanShellSampler.query">import org.apache.commons.io.FileUtils;
import org.json.JSONObject;

try {
    // Specify the path to your JSON file
    String filePath = &quot;/Users/moonlight/Desktop/loadtest-with-jmeter/Receive By ID Test Case/data/token.json&quot;;

    // Read the JSON file into a String
    String jsonContent = FileUtils.readFileToString(new File(filePath), &quot;UTF-8&quot;);

    // Parse the JSON String into a JSONObject
    JSONObject jsonObject = new JSONObject(jsonContent);

    // Save the JSONObject in a JMeter variable
    vars.put(&quot;tokens&quot;, jsonObject.toString());

    // Log the contents for verification (optional)
    log.info(&quot;=====JSON Contents: &quot; + jsonObject.toString());
} catch (Exception e) {
    log.error(&quot;Error reading JSON file: &quot; + e.getMessage());
    throw e;
}</stringProp>
        </BeanShellSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="false">
        <intProp name="ThreadGroup.num_threads">3</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="false">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">/Users/moonlight/Desktop/loadtest-with-jmeter/Receive By ID Test Case/data/tokens.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">id,token</stringProp>
        </CSVDataSet>
        <hashTree/>
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="false">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">log.info(vars.get(&quot;token&quot;) + &quot;=====&quot;);

String id = vars.get(&quot;id&quot;);

if(id.equals(&quot;50000&quot;)) {
	log.info(&quot;this is userid 50000&quot;);
}
</stringProp>
        </BeanShellPreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET receive_by_id ${user_id_0}" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">33380</stringProp>
          <stringProp name="HTTPSampler.path">/api/v32/receives/ids/${id}1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import groovy.json.JsonSlurper

// Read token.json file
def tokenJson = new File(&quot;/Users/moonlight/Desktop/mcportal-load-testing/data/token.json&quot;).text
def tokens = (new JsonSlurper()).parseText(tokenJson).tokens

// Read metadata.json file
def metadataJson = new File(&quot;/Users/moonlight/Desktop/mcportal-load-testing/data/metadata.json&quot;).text
def metadata = (new JsonSlurper()).parseText(metadataJson).case1

// Iterate through the metadata and map user_id with receive_id
int count = 0
metadata.each { caseItem -&gt;
    caseItem.delivery[0].event.each { event -&gt;
        event.delivery.receive.each { receive -&gt;
            def user_id = receive.user_id
            def receive_id = receive.receive_id
            
            // Get the token for the user_id
            def token = tokens[user_id] ?: &quot;&quot;

            // Save the values in variables
            vars.put(&quot;user_id_&quot; + count, user_id)
            vars.put(&quot;receive_id_&quot; + count, receive_id)
            vars.put(&quot;token_&quot; + count, token)

		  log.info(&apos;====user_id_&apos;, user_id)
            count++
        }
    }
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>